Revit 2024 API
PipeFittingAndAccessoryPressureDropItem Members
The PipeFittingAndAccessoryPressureDropItem type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryPressureDropItem
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BeginConnectorIndex
 The index of the begin connector of the flow path
Coefficient
 The coefficient between the begin connector and end connector, Units: (kg/(ft·s²)).
EndConnectorIndex
 The index of the end conector of the flow path
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
VelocityPressure
 The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
See Also
PipeFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Plumbing Namespace